#Задание 1
age =  int(input("Введите ваш возраст:"))
age1 = int(input("Введите возраст вашего друга:"))
print ("Сумма ваших возрастов:" ,age + age1)
#Задание 2 
name = input("Введите ваше имя:")
surname = input("Введите вашу фамилию:")
print (f"Привет, {name} {surname}!")
#Задание 3
print("Меню:\n 1. Суп\n 2. Паста\n 3. Десерт")
#Задание 4
print("***\n***\n***\n")
#Задание 5
x = int(input("Число: "))
print(x-3,x-2,x-1)
print(x)
print(x+3,x+2,x+1) 
